In [1]:
import pandas as pd
df=pd.DataFrame({'usn':[100,101,102],'name':['sham','joy','ram'],'marks':[100,89,99]})

In [2]:
df

   usn  name  marks
0  100  sham    100
1  101   joy     89
2  102   ram     99

In [3]:
df['usn']

0    100
1    101
2    102
Name: usn, dtype: int64

In [4]:
df[['usn','name']]

   usn  name
0  100  sham
1  101   joy
2  102   ram

In [5]:
df.loc[2]

usn      102
name     ram
marks     99
Name: 2, dtype: object

In [6]:
df[['usn','name','marks']]

   usn  name  marks
0  100  sham    100
1  101   joy     89
2  102   ram     99

In [7]:
df.iloc[2]

usn      102
name     ram
marks     99
Name: 2, dtype: object

In [8]:
df.loc[[0,1],['usn','marks']]

   usn  marks
0  100    100
1  101     89